# Integer
# Челые числа. Операции сложения, вычитания, умножения и деления
x = 2
y = 3
print(x + y)
z = x+y
print(z)

print(2 * 5)

# При делении целого числа на целое число всегда в выводе будем иметь Float - число с плавающей запятой
print(4 / 4)

x = 10
y = 2
d = x / y
print(d)

# Возведение в степень (x ** x)
q = 8
a = q ** q
print(a)

# Вычитание чисел
print(10-8)
var1 = 50
var2 = 41
var = var1 - var2
print(var)

# Float  - числа с плавающей запятой (вещественные числа)
var3 = 2.5
var4 = 4.5
sum = var3 * var4
print(sum)

# Но при выполнении операций с плавающей точкой результат не всегда тот, который ожидается
print(0.2 * 0.2)
